@BuJo Still running into this issue. I'm using the `user` example code from this repository.
```
✦ ×  terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # minio_iam_user.minio_user will be created
  + resource "minio_iam_user" "minio_user" {
      + disable_user  = false
      + force_destroy = false
      + id            = (known after apply)
      + name          = "minio_user_tf"
      + secret        = (sensitive value)
      + status        = (known after apply)
      + update_secret = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + minio_user_status = (known after apply)
  + user_minio_user   = (known after apply)

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

minio_iam_user.minio_user: Creating...
╷
│ Error: [FATAL] Error creating user (minio_user_tf): This 'admin' API is not supported by server in 'mode-server-fs'
│
│   with minio_iam_user.minio_user,
│   on user.tf line 1, in resource "minio_iam_user" "minio_user":
│    1: resource "minio_iam_user" "minio_user" {
```